[
  {
    "job_title": "Internal Auditor",
    "company": "A 100% Export Oriented Denim, Woven, Top Bottom Garments Manufacturing, Washing Company",
    "location": "Dhaka (Ashulia, Uttara)",
    "experience": "6 to 7 years",
    "education": [
      "Bachelor of Business Administration (BBA) in Accounting",
      "Bachelor of Business Administration (BBA) in Finance",
      "Bachelor/Honors",
      "CA or CMA partially completed"
    ],
    "skills": [
      "Auditing skill",
      "Commanding",
      "Data analysis",
      "Good communication skills",
      "Interpretation",
      "Knowledgeable about Bangladesh Labor Law",
      "organized",
      "Reporting and Documentation",
      "Risk Assessment",
      "Team Leading"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394432&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Review purchase orders, cost sheets, and pricing approvals to ensure accuracy and transparency of merchandising, purchasing procedure denim & headwear products.",
      "Verify that raw material bookings (fabric/trims) match order requirements and approved consumption.",
      "Audit vouchers, receipts, and payment records for accuracy.",
      "Ensure tax (VAT, AIT) is correctly calculated and submitted.",
      "Verify production planning against capacity, order quantity, and delivery schedules.",
      "Verify compliance with customs regulations, LC (Letter of Credit) requirements, and trade laws, Conduct Audits.",
      "Review sample development timelines and approvals to ensure adherence to buyer requirements.",
      "Cross-check garment costing sheets for accuracy in fabric consumption, trims, CM, and overhead calculations.",
      "Monitor T&A (Time & Action) plans for realistic timelines and on-time execution.",
      "Identify risks such as incorrect order entry, unapproved changes, or delayed approvals.",
      "Conduct unannounced audit or audit in any time in Accounts & Finance, Commercial & other departments as well."
    ]
  },
  {
    "job_title": "Asst. Manager / Manager (Accounts)",
    "company": "A largest export-oriented garments group of company",
    "location": "Narayanganj",
    "experience": "At least 8 years",
    "education": [
      "Master of Business Administration (MBA) in Accounting",
      "Master of Business Administration (MBA) in Finance & Banking",
      "CA (Chartered Accountancy) course completed (CA CC)",
      "Part-qualified ICAB"
    ],
    "skills": [
      "accounting software",
      "MS Office (MS word MS Excel)",
      "Tally ERP 9",
      "IAS (International Accounting Standards)/ IFRS (International Financial Reporting Standards)",
      "Company Act",
      "Income Tax",
      "VAT",
      "Fluent verbal and written communication skills in English and Bengali",
      "Strategic Leadership skills",
      "Proactive attitude"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394454&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Ensure proper implementation of financial policies and procedures at strategic level through supervising and guiding the team for managing the overall activities of accounting and financial functions by maintaining co-ordination with different functional line such as Supply chain Dept, Sales dept, Marketing Dept and Factory.",
      "Develop a sound and effective Management information system which includes identifications of market gap, root cause identification and analysis for credit monitoring and controlling.",
      "Process payroll and ensure accurate and timely salary disbursement to all employees.",
      "Maintain organized and accurate financial documentation for all transactions and processes, timely Maintenance of Bills, Vouchers, Deeds, Documents, Ledgers etc. including proper Record Keeping System.",
      "Ensure adherence to accounting standards and regulatory requirements to maintain integrity and transparency.",
      "Assist in the preparation of monthly, quarterly, and annual financial reports. Support the audit process by coordinating with internal and external auditors.",
      "Maintain accurate and up-to-date records of all financial transactions.",
      "Maintain the general ledger and ensure all accounting transactions are recorded accurately.",
      "Ensure compliance with VAT, Income Tax, and Advance Income Tax (AIT) regulations; prepare and file tax returns as required.",
      "Prepare and process bills and invoices for clients and suppliers in a timely manner.",
      "Manage cash collection processes to ensure timely receipt of payments and maintain cash flow.",
      "Provide financial insights and analysis to support business decisions and strategic planning initiatives.",
      "Undertake any other tasks as assigned by management to support the overall functioning of the company.",
      "Any other kind of task that management may require to be done."
    ]
  },
  {
    "job_title": "Head of Finance and Operations",
    "company": "Jhpiego Bangladesh",
    "location": "Dhaka",
    "experience": "At least 10 years",
    "education": [
      "Master of Business Administration (MBA)",
      "Master of Commerce (MCom) in Finance",
      "Master of Commerce (MCom) in Accounting",
      "Master of Business Studies (MBS) in Accounting",
      "Master of Business Studies (MBS) in Finance",
      "Master’s degree in finance/accounting/business administration",
      "A Professional Degree in CA/ACCA/ACMA or equivalent"
    ],
    "skills": [
      "Excellent computer skills with all Microsoft Office programs (MS Word, Power Point, Excel) and financial management software",
      "Public relations",
      "communication",
      "coordination",
      "Networking skills",
      "Excellent influencing, negotiating and communication skills",
      "Excellent organization, and coordination skills",
      "Recording and reporting",
      "Strong planning /organization skills",
      "Presentation and interpersonal skills",
      "Budget Development",
      "Cash Flow Forecast",
      "Compliance",
      "Finance/ Accounts",
      "Financial Forecasting",
      "Financial Reporting",
      "Financial Software",
      "Managerial Skill",
      "Procurement Process"
    ],
    "deadline": "15 Aug 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394393&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Ensure Country Office financial policies and procedures are updated to reflect global changes in Jhpiego, donors and the GoB financial regulations.",
      "Ensure required financial controls are in place, adhered to and regularly reviewed",
      "Provide guidance to the Country Lead and other program personnel regarding the financial requirements of the project and office operations",
      "Manage Jhpiego/Bangladesh’s financial resources, budgeting, tracking and monitoring of financial expenditures.",
      "Ensure that award resources are appropriately directed to project priorities and are in line with project work plans and work closely with program persons to ensure spending is in line with budgets.",
      "Direct the annual budgeting process for all assigned accounts",
      "Closely work with Finance team members to ensure budget accuracy, expense tracking on a regular basis to prevent over-expenditure of budgets",
      "Review monthly fund requests and projections to support forecasting accuracy and project completion as required.",
      "Review monthly financial reporting (QuickBooks) files and bank reconciliations and ensure its timely submission to Jhpiego HQ office in Baltimore",
      "Play a leading role in the closing of the month and year-end financial reports.",
      "Monitor accurate and timely submission of financial reports and attendant schedules and attachments to government regulatory agencies",
      "Coordinate preparation of control reports, respond to findings and recommend resolutions or action plans as well as ensure all donors and NGOAB related audit requirements are complied",
      "Establish and implement short and long-range departmental goals, objectives, policies, and operating procedures.",
      "Be the point person for all finance inquiries and communicate with all donors on financial issues relating to reporting. Advise the CO management team on all financial matters.",
      "Develop, implement and adapt standardized, efficient and effective operational systems to optimize in-country performance",
      "Identify and communicate compliance and risk issues to the Country Lead and HQ and provide overall guidance and support in resolving such issues.",
      "Provide oversight on office management, procurement and logistics and transport functions to ensure that adequate systems and processes have been established for these areas of support and that adequate internal controls are in place.",
      "Work with the Country Lead to regularly review and update office safety and security manual, systems and procedures to ensure regular updates and training are provided to staff, telephone tree and emergency contact information is available and overall preparedness for the Jhpiego/Bangladesh office.",
      "Maintain effective communication and coordination with external accounting firm/audit firm as needed",
      "Lead, manage, and motivate the entire team, ensuring that they have clear objectives and receive functional feedback on their performance",
      "Ensure proper staff safety and security measures have been taken and aware people about their personal safety",
      "Ensure that Administrative and Procurement function can effectively deliver quality goods and services on time",
      "Provide guidance, monitoring and support to project teams to plan their needs in terms of goods and service procurement, resource utilization and other logistical support for local and international travel for staff and consultants",
      "Ensure overall maintenance and best use of office space and other assets and equipment",
      "Ensure on time submission of invoices related to procurement by adhering compliance",
      "Management and review of standardized contracts/lease agreements between Jhpiego Bangladesh Country program and landlords as well as ensure on time renewal or notices",
      "Ensure up to date vendor list is on place and do the necessary coordination for issuing on time service contracts and necessary extensions",
      "Supervise the work of Admin department staff and ensure they perform to the expected standards. This includes mentoring and motivating them to undertake their roles and responsibilities effectively.",
      "Any other job related to the function will be allocated as and when required by the Supervisor."
    ]
  },
  {
    "job_title": "Executive / Senior Executive (Accounts & Finance)",
    "company": "A Reputed Hospital",
    "location": "Dhaka (Khilgaon, Rampura, Shantinagar)",
    "experience": "At least 2 years",
    "education": [
      "Master of Business Administration (MBA)",
      "Master of Business Studies (MBS)",
      "CA(CC) from a reputed CA firm"
    ],
    "skills": [
      "Proficient in accounting software (e.g., Tally, ERP systems)",
      "High proficiency in MS Excel, Word, and other Office applications"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394365&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Ensure timely and proper documentation of all payments, receipts, and journal entries",
      "Coordinate with procurement and admin departments to ensure timely supplier payments and proper documentation.",
      "Assist in the preparation of daily, weekly, and monthly financial statements and operational reports.",
      "Maintain organized financial files and systems for easy access and reference.",
      "Perform any other duties or responsibilities assigned by management or the Head of Department, aligned with the objectives of the Accounts & Finance Department and overall hospital operations."
    ]
  },
  {
    "job_title": "Executive, VAT",
    "company": "One Pharma Limited",
    "location": "Bogura",
    "experience": "7 to 8 years",
    "education": [
      "BBA/ MBA in any discipline"
    ],
    "skills": [
      "MS Office",
      "Internet based application"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394350&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Ensure Proper Compliance with VAT Act & SD 2012 Manufacturing Plant.",
      "Maintain and Reconcile VAT Register (6.1,6.2,6.3,6.10).",
      "Ensure Correct Input-Output Coefficient (Mushak-4.3).",
      "Monthly VAT Calculation and Timely deposit to the Government Treasury.",
      "Maintain Toll Issues (Mushak-6.4).",
      "Reconciliation of commercial Department Import & Local Purchase Purpose.",
      "Preparation Monthly VAT Return (Mushak-9.1).",
      "Liaise with VAT Cercle Offices."
    ]
  },
  {
    "job_title": "Assistant Accounts Officer",
    "company": "Sarker Real Estate Limited",
    "location": "Dhaka",
    "experience": "1 to 2 years",
    "education": [
      "Bachelor of Business Administration (BBA) in Finance",
      "Master of Business Administration (MBA) in Finance",
      "Bachelor of Business Administration (BBA) in Accounting",
      "Master of Business Administration (MBA) in Accounting",
      "BBA/ MBA in Finance or Accounting/ MA in commerce"
    ],
    "skills": [
      "Good typing knowledge in Bengali (Bijoy Bangla)",
      "Leadership skills",
      "Excellent written and communication skills",
      "MS Excel and/or other financial tools",
      "Analytical approach to work",
      "High numeracy and sound technical skills",
      "Ability to detect numerical anomalies on reports at a glance",
      "Pleasant personality, honesty, smartness & hardworking ability",
      "Good communication & negotiation skill and ability to work under pressure",
      "Excellent interpersonal communication skill and sufficient knowledge in computer",
      "Good command in English both oral and written"
    ],
    "deadline": "08 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394325&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Maintain all books of accounts, Balance Sheet, Monthly Report, Quarterly Report, register, ledger following accounting standard and accounting principles and policies of the organization.",
      "Preparation of financial statements and necessary reports periodically, preparation of Financial Models using computer software in different aspects as required by the management.",
      "Ensure accounting accuracy in all transactions entered into the system and ensure the same is posted before month-end.",
      "Making Monthly salary sheet for all portfolio of the company."
    ]
  },
  {
    "job_title": "Sr. Accounts Officer",
    "company": "A fast-growing A-type Korean factory tent manufacturing company located in CEPZ",
    "location": "Chattogram",
    "experience": "1 to 2 years",
    "education": [
      "Master of Commerce (MCom) in Accounting",
      "Master of Business Administration (MBA) in Accounting",
      "C.A (C. C)"
    ],
    "skills": [
      "MS Office (Word, Excel, Outlook, Accounting Software)",
      "VAT and Tax regulations",
      "Excellent oral and written English communication skills"
    ],
    "deadline": "16 Aug 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394282&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Handling daily cash and bank transactions.",
      "Preparing the cash and bank, vouchers and posting them into the accounting software in due time.",
      "Ensure proper accounts, cash, and bank transactions, receipts, and payment statements.",
      "Monitor and analyses accounting data, trial balance, and oversee the daily accounts operations.",
      "Prepare monthly bank/loan reconciliation statements.",
      "Preparation of monthly, quarterly, and annual financial statements.",
      "Should know VAT and Tax regulations.",
      "Prepare and present monthly reports on P.F. contributions, liabilities, and distributions.",
      "Ensure all activities related to P.F. meet regulatory requirements and organizational policies.",
      "Ensure all the inventory and reported to the management.",
      "Must have excellent oral and written English communication skills.",
      "A higher authority gives any other assignment."
    ]
  },
  {
    "job_title": "Sr. Accounts Executive",
    "company": "Nutrition Depot",
    "location": "Dhaka (Uttara)",
    "experience": "At least 1 years",
    "education": [
      "Bachelor/Honors"
    ],
    "skills": [
      "Accounting Data Entry",
      "Data Management",
      "Finance/ Accounts",
      "Financial Reporting",
      "Reporting skill"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394283&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Prepare and analyze sales reports (daily, weekly, monthly) to track performance and identify trends",
      "Ensure stock accuracy across all locations, verifying physical stock matches Odoo records (solve product live issue permanently)",
      "Address any discrepancies and implement new processes or formats to prevent future issues and maintain consistent stock accountability.",
      "Conduct regular stock audits at all inventory locations to identify gaps and mis-management (warehouse, stores, marketplace/B2B, website, SAND factory, and any other locations)",
      "Conduct asset audits on a quarterly basis across offices, warehouses and factory.",
      "Ensure accountability & safeguard against financial loss",
      "Reporting accountability metrics weekly and monthly basis in areas of stock / inventory / packaging, returns, damaged products, revenue collection",
      "Returns cross-check: ensure we received and processed all CAD & EXR",
      "Near expiry detection & management: Identify and report near expiry items to fast sales, prevent financial loss or discount selling from expired stock.",
      "Ensure 100% collection from all revenue channels (retail, online, Pathao, wholesale, B2B, Daraz, Foodpanda, events, damage sales, etc.)",
      "Verify deposits: track all collections with proof",
      "Report missed collections: with high urgency & chase for payment",
      "Ensure on-time collections",
      "Maintain Pathao lost/damage sheet & collect compensation or any dues",
      "Lead Odoo/ERP implementation across all business functions (reporting, accounts, finances, sales, inventory etc)",
      "Integrate Odoo to streamline processes and improve efficiency",
      "Continuously identify and implement process improvements to save time and enhance performance",
      "Assist in developing operations SOPs for various departments",
      "Maintain accurate and up-to-date financial records",
      "Support in banking assistance if needed",
      "Support in admin functions if needed",
      "Report any business loss incurred or can potentially incur / find ways to save money / reduce sunk loss"
    ]
  },
  {
    "job_title": "Finacial Manager",
    "company": "RBR Innovations Limited",
    "location": "Anywhere in Bangladesh",
    "experience": "At least 5 years",
    "education": [
      "Bachelor of Business Administration (BBA)"
    ],
    "skills": [
      "Finance/ Accounts"
    ],
    "deadline": "09 Sep 2025",
    "published_date": "10 Aug 2025",
    "job_link": "https://jobs.bdjobs.com/jobdetails/?id=1394290&fcatId=1&ln=1",
    "site_name": "bdjobs.com",
    "Responsibilities": [
      "Be responsible for the relevant financial work with other companies.",
      "Be responsible for formulating various financial and accounting systems, regulations and measures.",
      "Implement various financial and accounting systems, regulations and measures.",
      "Explain and answer regulations and systems related to the company's financial accounting.",
      "Analyze and inspect the implementation of the company's financial expenditures and budgets.",
      "Review the company's daily accounting business.",
      "Focus on coordinating and handling the relevant work and affairs of the tax department.",
      "Be responsible for the review of the company's current business expenses.",
      "Be responsible for the summary and settlement of the company's business transaction expenses.",
      "Be responsible for the management of business and work discipline of the company's financial personnel.",
      "Be responsible for salary distribution and verification work.",
      "Ensure smooth coordination among all shareholders.",
      "Strictly arrange the rest time of the employees under your jurisdiction in accordance with the provisions of the Labor Law.",
      "Be responsible for the review of the company's insurance and the payment of employees' endowment insurance premiums as well as property insurance.",
      "Communicate with the General Office in a timely manner.",
      "Be responsible for ensuring that the company's system covers the affiliated work of this department.",
      "Complete the ERP implementation work of this department well.",
      "Do a good job in liaison with the superior business authorities.",
      "Be responsible for providing financial data for various submitted items (projects).",
      "Be responsible for formulating and implementing the job responsibilities and assessment work of the affiliated departments.",
      "Implement the company's regular meeting system.",
      "Do a good job in the talent cultivation of the departments under jurisdiction and build a talent echelon for Runtu.",
      "Strengthen the implementation of informatization in this department and ensure the confidentiality of company information."
    ]
  }
]